{
    "Gilgamesh": "The Epic of Gilgamesh is one of the oldest known works of literature, originating from ancient Mesopotamia. It tells the story of Gilgamesh, the powerful king of Uruk, who is two-thirds divine and one-third human. At first, he is a tyrant, abusing his power. The gods create Enkidu, a wild man, to challenge him. After a fierce battle, they become close friends. Together, they embark on heroic adventures, defeating the monster Humbaba in the Cedar Forest and killing the Bull of Heaven sent by the goddess Ishtar.\n\nAfter Enkidu's death, Gilgamesh is stricken with grief and begins a journey to find immortality. He travels across dangerous lands to find Utnapishtim, a man who survived a great flood and was granted eternal life by the gods. Utnapishtim tells him that immortality is reserved for the gods and shares the story of the flood, which closely resembles the later story of Noah's Ark. Although Gilgamesh fails to gain eternal life, he returns to Uruk wiser and accepting of human mortality. The epic ends with Gilgamesh finding meaning in the legacy he leaves through the great city he ruled.",
    "metadata": "Translated and summarized from the Standard Babylonian version, attributed to Sin-leqi-unninni, written around 1200 BCE.",
    "KingArthur": "King Arthur is a legendary British leader who, according to medieval histories and romances, led the defense of Britain against Saxon invaders in the late 5th and early 6th centuries. The details of Arthur's story are mainly known from medieval literature, particularly the works of Geoffrey of Monmouth, Sir Thomas Malory, and later adaptations.\n\nArthur is often depicted as the son of Uther Pendragon and Igraine, raised by Sir Ector. He pulls the sword Excalibur from a stone, proving his right to the throne. He establishes the Knights of the Round Table at Camelot, where he rules with wisdom and justice. His reign is marked by quests for the Holy Grail, battles against enemies like Mordred, and tragic romances, particularly with Guinevere.\n\nThe legend of King Arthur has inspired countless adaptations in literature, film, and other media, symbolizing chivalry, heroism, and the quest for justice.",
    "metadata1": "Based on various medieval sources, including Geoffrey of Monmouth's 'Historia Regum Britanniae' and Sir Thomas Malory's 'Le Morte d'Arthur', compiled in the 15th century.",
    "BabaYaga": "Baba Yaga is a prominent figure in Slavic folklore, often depicted as a fearsome old witch who lives in a hut that stands on chicken legs. She is known for her ambiguous nature, sometimes helping and sometimes hindering those who seek her out.\n\nIn many tales, Baba Yaga is portrayed as a guardian of the forest and the dead, possessing great knowledge of magic and herbalism. She often tests heroes or heroines who come to her seeking wisdom or assistance. If they pass her tests, she may provide them with magical items or guidance; if they fail, they may face dire consequences.\n\nBaba Yaga's stories vary widely across different cultures, but she remains a symbol of the wild, untamed aspects of nature and the duality of good and evil.",
    "metadata2": "Derived from various Slavic folktales, with roots in oral traditions that date back centuries. The character has been adapted in numerous literary and artistic works."
}